logik/domino.html
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Dominoproblem</a>
<ul>
<li><a href="#sec-1-1">1.1. <span class="todo TODO">TODO</span> Modellierung aus Serie 5 übernehmen</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Dominoproblem</h2>
<div class="outline-text-2" id="text-1">
<p>
Eine Instanz ist gegeben durch <i>Typen</i>. Ein Typ ist ein Vierertupel von natürlichen Zahlen
</p>

<p>
<b>positive Instanzen:</b> Man kann mit den vorgegeben Steinen (<i>Typen</i>) den ersten
 Quadranten auslegen, sodass benachbarte Kante dieselbe Farbe habenund
 unten links der erste Stein liegt.
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> <span class="todo TODO">TODO</span> Modellierung aus Serie 5 übernehmen</h3>
<div class="outline-text-3" id="text-1-1">
<p>
<b>Modellierung:</b> Wir verwenden Variablen der Form
</p>

<p>
\(X_{i,j}^k\): "An der Position \((i,j)\) liegt der Stein \(k\)
</p>
</div>
</div>
</div>
